--Запросы для нескольких таблиц с группировкой
--В запросах с групповыми функциями могут использоваться несколько таблиц, между которыми используются различные типы соединений.

--Пример

--Вывести количество различных книг каждого автора. Информацию отсортировать в алфавитном порядке по фамилиям  авторов.

--Запрос:

SELECT name_author, count(title) AS Количество
FROM 
    author INNER JOIN book
    on author.author_id = book.author_id
GROUP BY name_author
ORDER BY name_author;    
--Результат

+------------------+------------+
| name_author      | Количество |
+------------------+------------+
| Булгаков М.А.    | 2          |
| Достоевский Ф.М. | 3          |
| Есенин С.А.      | 2          |
| Пастернак Б.Л.   | 1          |
+------------------+------------+
--При использовании соединения INNER JOIN мы не можем узнать, что книг Лермонтова на складе нет, но предполагается, что они могут быть.  Чтобы автор Лермонтов был включен в результат, нужно изменить соединение таблиц.

--Запрос:

SELECT name_author, count(title) AS Количество
FROM 
    author LEFT JOIN book
    on author.author_id = book.author_id
GROUP BY name_author
ORDER BY name_author;   
--Результат:

+------------------+------------+
| name_author      | Количество |
+------------------+------------+
| Булгаков М.А.    | 2          |
| Достоевский Ф.М. | 3          |
| Есенин С.А.      | 2          |
| Лермонтов М.Ю.   | 0          |
| Пастернак Б.Л.   | 1          |
+------------------+------------+
--Задание
--Посчитать количество экземпляров  книг каждого автора из таблицы author.  Вывести тех авторов,  количество книг которых меньше 10, в отсортированном по возрастанию количества виде. Последний столбец назвать Количество.
--Пояснение
--Чтобы в результат были включены авторы, книг которых на складе нет, необходимо в условии отбора, кроме того, что общее количество книг каждого автора меньше 10, учесть, что у автора вообще может не быть книг (то есть COUNT(title) = 0).
select name_author, sum(amount) as Количество from author
left join book on author.author_id=book.author_id
group by name_author 
having Количество < 10 or sum(amount) is null
order by Количество asc  

--или

--Для замены NULL лучше использовать функцию COALESCE, которая возвращает первое NOT NULL значение из списка.
--Это то для чего она была создана.

SELECT
    a.name_author,
    COALESCE(SUM(b.amount), 0) AS Количество
...

--Ну и для данного задания это стоит делать в блоке HAVING, т.к. валидатор ожидает увидеть NULL в колонке [Количество] для Лермонтова.